mgo-tec/esp32_ssd1331_bv2/src/esp32_ssd1331_bv2.cpp
/*
  esp32_ssd1331_bv2.cpp - for Arduino core for the ESP32 ( Use SPI library ).
  Beta version 2.0.0
  
  Modified ESP32_SSD1331 beta ver 1.71.
  
The MIT License (MIT)

Copyright (c) 2017 Mgo-tec. All rights reserved.
Blog URL ---> https://www.mgo-tec.com

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

SPI.h (SPI library for ESP32)
Copyright (c) 2015 Hristo Gochkov. All rights reserved.
License : LGPL 2.1
*/

#include "esp32_ssd1331_bv2.h"

Esp32Ssd1331Bv2::Esp32Ssd1331Bv2(uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t cs, uint8_t dc, uint8_t rst)
  :mp_sck(sck)
  , mp_miso(miso)
  , mp_mosi(mosi)
  , mp_cs(cs)
  , mp_dc(dc)
  , mp_rst(rst)
{}

static SPIClass MySPI(HSPI);

//************ SSD1331 256色カラー初期化 ****************************************
void Esp32Ssd1331Bv2::init(){
  Esp32Ssd1331Bv2::init(true, 0, 0, 0, false);
}
//************ SSD1331 256色カラー初期化 ****************************************
void Esp32Ssd1331Bv2::init65kColor(){
  Esp32Ssd1331Bv2::init(true, 0, 0, 0, true);
}

//************ SSD1331 初期化 ****************************************
void Esp32Ssd1331Bv2::init(bool bl, uint8_t cs1, uint8_t cs2, uint8_t cs3, bool isColor_65k){
  pinMode(mp_rst, OUTPUT); //RES
  pinMode(mp_dc, OUTPUT); //DC

  digitalWrite(mp_rst, HIGH);
  digitalWrite(mp_rst, LOW);
  delay(1);
  digitalWrite(mp_rst, HIGH);

  digitalWrite(mp_dc, HIGH);

  if(bl == false){
    MySPI.begin(mp_sck, mp_miso, mp_mosi, -1);
  }else{
    MySPI.begin(mp_sck, mp_miso, mp_mosi, mp_cs);
  }
  
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  MySPI.setHwCs(bl);
  
  if(cs1 > 0){
    pinMode(cs1, OUTPUT);
    digitalWrite(cs1, HIGH);
    digitalWrite(cs1, LOW);
  }
  if(cs2 > 0){
    pinMode(cs2, OUTPUT);
    digitalWrite(cs2, HIGH);
    digitalWrite(cs2, LOW);
  }
  if(cs3 > 0){
    pinMode(cs3, OUTPUT);
    digitalWrite(cs3, HIGH);
    digitalWrite(cs3, LOW);
  }

  writeSpiCommand(0xAE); //Set Display Off
  writeSpiCommand(0xA0); //Remap & Color Depth setting
    if(isColor_65k){
      writeSpiCommand(0b01110010); //A[7:6] = 00; 256 color. A[7:6] = 01; 65k color format
    }else{
      writeSpiCommand(0b00110010); //A[7:6] = 00; 256 color. A[7:6] = 01; 65k color format
    }
  writeSpiCommand(0xA1); //Set Display Start Line
    writeSpiCommand(0);
  writeSpiCommand(0xA2); //Set Display Offset
    writeSpiCommand(0);
  writeSpiCommand(0xA4); //Set Display Mode (Normal)
  writeSpiCommand(0xA8); //Set Multiplex Ratio
    writeSpiCommand(0b00111111); //15-63
  writeSpiCommand(0xAD); //Set Master Configration
    writeSpiCommand(0b10001110); //a[0]=0 Select external Vcc supply, a[0]=1 Reserved(reset)
  writeSpiCommand(0xB0); //Power Save Mode
    writeSpiCommand(0b00000000); //0x1A Enable power save mode
  writeSpiCommand(0xB1); //Phase 1 and 2 period adjustment
    writeSpiCommand(0x74);
  writeSpiCommand(0xB3); //Display Clock DIV
    writeSpiCommand(0xF0);
  writeSpiCommand(0x8A); //Pre Charge A
    writeSpiCommand(0x81);
  writeSpiCommand(0x8B); //Pre Charge B
    writeSpiCommand(0x82);
  writeSpiCommand(0x8C); //Pre Charge C
    writeSpiCommand(0x83);
  writeSpiCommand(0xBB); //Set Pre-charge level
    writeSpiCommand(0x3A);
  writeSpiCommand(0xBE); //Set VcomH
    writeSpiCommand(0x3E);
  writeSpiCommand(0x87); //Set Master Current Control
    writeSpiCommand(0x06);
  writeSpiCommand(0x15); //Set Column Address
    writeSpiCommand(0);
    writeSpiCommand(95);
  writeSpiCommand(0x75); //Set Row Address
    writeSpiCommand(0);
    writeSpiCommand(63);
  writeSpiCommand(0x81); //Set Contrast for Color A
    writeSpiCommand(255);
  writeSpiCommand(0x82); //Set Contrast for Color B
    writeSpiCommand(255);
  writeSpiCommand(0x83); //Set Contrast for Color C
    writeSpiCommand(255);

  for(int j=0; j<64; j++){ //Display Black OUT
    for(int i=0; i<96; i++){
      writeSpiData(0x00);
      writeSpiData(0x00);
      writeSpiData(0x00);
    }
  }

  writeSpiCommand(0xAF); //Set Display On
  
  if(cs1 > 0){
    digitalWrite(cs1, HIGH);
  }
  if(cs2 > 0){
    digitalWrite(cs2, HIGH);
  }
  if(cs3 > 0){
    digitalWrite(cs3, HIGH);
  }
  delay(110); //ディスプレイONコマンドの後は最低100ms 必要
}
//*********** HSPI 通信送信 ***********************************
void Esp32Ssd1331Bv2::writeSpiCommand(uint8_t b){
  digitalWrite(mp_dc, LOW);//DC
  MySPI.write(b);
}

void Esp32Ssd1331Bv2::writeSpiData(uint8_t b){
  digitalWrite(mp_dc, HIGH);//DC
  MySPI.write(b);
}

void Esp32Ssd1331Bv2::writeSpiCommandBytes(uint8_t *b, uint16_t size){
  digitalWrite(mp_dc, LOW);//DC
  MySPI.writeBytes(b, size);

}

void Esp32Ssd1331Bv2::writeSpiDataBytes(uint8_t *b, uint16_t size){
  digitalWrite(mp_dc, HIGH);//DC
  MySPI.writeBytes(b, size);
}

//***********画面明るさ********************************
void Esp32Ssd1331Bv2::brightness(uint8_t brightness){
  writeSpiCommand(0x81); //Set Contrast for Color A
    writeSpiCommand(brightness);
  writeSpiCommand(0x82); //Set Contrast for Color B
    writeSpiCommand(brightness);
  writeSpiCommand(0x83); //Set Contrast for Color C
    writeSpiCommand(brightness);
}
//***********画面明るさフェードイン**********************
void Esp32Ssd1331Bv2::brightnessFadeIn(uint8_t interval){
  for(int brightness = 0; brightness < 256; brightness++){
    writeSpiCommand(0x81); //Set Contrast for Color A
      writeSpiCommand(brightness);
    writeSpiCommand(0x82); //Set Contrast for Color B
      writeSpiCommand(brightness);
    writeSpiCommand(0x83); //Set Contrast for Color C
      writeSpiCommand(brightness);
    delay(interval);
  }
}
//***********画面明るさフェードアウト********************
void Esp32Ssd1331Bv2::brightnessFadeOut(uint8_t interval){
  for(int brightness = 255; brightness >= 0; brightness--){
    writeSpiCommand(0x81); //Set Contrast for Color A
      writeSpiCommand(brightness);
    writeSpiCommand(0x82); //Set Contrast for Color B
      writeSpiCommand(brightness);
    writeSpiCommand(0x83); //Set Contrast for Color C
      writeSpiCommand(brightness);
    delay(interval);
  }
}
//***********ディスプレイ消去***************************
void Esp32Ssd1331Bv2::clearDisplay(){
  Esp32Ssd1331Bv2::clearDisplay(0, 0, 95, 63);
}
//***********ディスプレイ消去***************************
void Esp32Ssd1331Bv2::clearDisplay(uint8_t cs, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1){
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  //MySPI.setHwCs(bl);
  digitalWrite(cs, LOW);
  Esp32Ssd1331Bv2::clearDisplay(x0, y0, x1, y1);
  digitalWrite(cs, HIGH);
}

//***********ディスプレイ消去***************************
void Esp32Ssd1331Bv2::clearDisplay(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1){
  //delayMicroseconds(500); //クリアーコマンドは400μs 以上の休止期間が必要かも
  delay(1);
  writeSpiCommand(0x25); //Clear Window
    writeSpiCommand(x0); //Column Address of Start
    writeSpiCommand(y0); //Row Address of Start
    writeSpiCommand(x1); //Column Address of End
    writeSpiCommand(y1); //Row Address of End
  //delayMicroseconds(800); //ここの間隔は各自調節してください。
  delay(1);
}
//********** 範囲コピー *********************************
void Esp32Ssd1331Bv2::copyDisplay(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t to_x, uint8_t to_y){
  uint8_t buf[7];
  buf[0] = 0x23; //Copy Command
  buf[1] = x0; buf[2] = y0; buf[3] = x1; buf[4] = y1; buf[5] = to_x; buf[6] = to_y; 

  //delayMicroseconds(500);
  delay(1);
  writeSpiCommandBytes(buf, sizeof(buf)); 
  //delayMicroseconds(500);
  delay(1);
}
//********* OLED 8x16フォント出力 ********************
void Esp32Ssd1331Bv2::displayFont8x16(uint8_t cs, uint8_t txt_size, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t font_buf[][16]){
  digitalWrite(cs, LOW);
  Esp32Ssd1331Bv2::displayFont8x16(txt_size, x0, y0, red, green, blue, font_buf);
  digitalWrite(cs, HIGH);
}
//********* OLED 8x16フォント出力 ********************
void Esp32Ssd1331Bv2::displayFont8x16(uint8_t txt_size, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t font_buf[][16]){
  uint8_t com[6];
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  //MySPI.setHwCs(true);
  
  if( txt_size > 12) txt_size = 12;
  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0 + (8*txt_size) - 1;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0 + 15;

