mgo-tec/esp32_ssd1331_bv2/src/esp32_ssd1331_bv2.cpp
  writeSpiCommandBytes(com, 6);

  int i, j, k;
  uint8_t bt = 0b10000000;

  uint8_t Dot = (red << 5) | (green << 2) | blue;

  uint8_t dummy[16*txt_size*8];
  uint16_t cnt = 0;

  for(i=0; i<16; i++){
    for(j=0; j<txt_size; j++){
      for(k=0; k<8; k++){
        if( font_buf[j][i] & (bt >> k) ){
          dummy[cnt] = Dot;
        }else{
          dummy[cnt] = 0;
        }
        cnt++;
      }
    }
  }

  writeSpiDataBytes(dummy, (16 * txt_size * 8));
}
//********* OLED 8x16フォント　サイズアップ　出力 ********************
void Esp32Ssd1331Bv2::displaySizeUpFont8x16(uint8_t size, uint8_t txt_size, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t font_buf[][16]){
  Esp32Ssd1331Bv2::displayHVsizeUpFont8x16(size, size, txt_size, x0, y0, red, green, blue, font_buf);
}
//********* OLED 8x16フォント　サイズアップ　出力 ********************
void Esp32Ssd1331Bv2::displayHVsizeUpFont8x16(uint8_t h_size, uint8_t v_size, uint8_t txt_size, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t font_buf[][16]){
  uint8_t com[6];
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  //MySPI.setHwCs(true);
  
  if( txt_size > 12) txt_size = 12;
  
  if(h_size == 4){
    txt_size = 3;
  }else if(h_size == 2){
    txt_size = 6;
  }
  uint8_t txtmax_sizeup = txt_size * (8 * h_size);
  
  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    //com[2] = 95;
    com[2] = x0 + txtmax_sizeup - 1;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0 + (16*v_size)-1;
    //com[5] = 63;

  writeSpiCommandBytes(com, 6);

  int i, j, k, ii;
  uint8_t bt = 0b10000000;

  uint8_t Dot = (red << 5) | (green << 2) | blue;
  
  uint8_t dummy[16*v_size][96] = {};
  
  uint16_t cnt = 0;

  uint8_t size_cnt=0;
  for(i=0; i<16; i++){
      for(j=0; j<txt_size; j++){
        for(k=0; k<8; k++){
          if( font_buf[j][i] & (bt >> k) ){
            for(ii=0; ii<h_size; ii++){
              dummy[i][cnt++] = Dot;
            }
          }else{
            cnt = cnt + h_size;
          }
        }
      }
      cnt = 0;
  }
  //digitalWrite(mp_dc, LOW);//DC

  for(i=0; i<16; i++){
    for(size_cnt=0; size_cnt<v_size; size_cnt++){
      writeSpiDataBytes(dummy[i], (txtmax_sizeup));
      //MySPI.writeBytes(dummy[i], (txtmax_sizeup));
    }
  }
}
//********* OLED 8x8フォント出力 ********************
void Esp32Ssd1331Bv2::displayFont8x8(uint8_t txt_size, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t font_buf[][8]){
  uint8_t com[6];
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  //MySPI.setHwCs(true);

  if( txt_size > 12) txt_size = 12;
  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0 + (8*txt_size) - 1;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0 + 7;

  writeSpiCommandBytes(com, sizeof(com));

  int i, j, k;
  uint8_t bt = 0b10000000;

  uint8_t Dot = (red << 5) | (green << 2) | blue;

  uint8_t dummy[8*txt_size*8];
  uint16_t cnt = 0;

  for(i=0; i<8; i++){
    for(j=0; j<txt_size; j++){
      for(k=0; k<8; k++){
        if( font_buf[j][i] & (bt >> k) ){
          dummy[cnt] = Dot;
        }else{
          dummy[cnt] = 0;
        }
        cnt++;
      }
    }
  }

  writeSpiDataBytes(dummy, (8 * txt_size * 8));
}
//*********** 時刻垂直スクロール ****************
void Esp32Ssd1331Bv2::VscrollFont16x16(uint8_t direction, uint8_t full_or_half, uint8_t buf[2][16], uint8_t *scroll_count, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t red, uint8_t green, uint8_t blue){
  Esp32Ssd1331Bv2::copyVscrollSizeUpFont(false, 1, direction, full_or_half, buf, *scroll_count, x0, y0, y1, red, green, blue);
  (*scroll_count)++;
}
//*********** 16x16フォント１文字水平スクロール **********************
void Esp32Ssd1331Bv2::HscrollFont16x16(uint8_t direction, uint8_t full_or_half, uint8_t buf[2][16], uint8_t *scroll_count, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t red, uint8_t green, uint8_t blue){
  uint8_t com[6];
  uint8_t Dot = (red << 5) | (green << 2) | blue;
  uint8_t i;
  uint8_t k = 0;
  uint8_t bbb = 0;

  switch( direction ){
    case 0:
      copyDisplay(x0+1, y0, x1, y1, x0, y0);

      com[0] = 0x15; //Set Column Address
        com[1] = x1; com[2] = x1;
      com[3] = 0x75; //Set Row Address
        com[4] = y0; com[5] = y1;

      if((*scroll_count) < 8){
        bbb = 0b10000000 >> (*scroll_count);
      }else if((*scroll_count) >= 8){
        bbb = 0b10000000 >> ((*scroll_count)-8);
      }

      if((*scroll_count) < 8){
        k = 0;
      }else{
        k = 1;
      }

      break;
    case 1:
      copyDisplay(x0, y0, x1-1, y1, x0+1, y0);

      com[0] = 0x15; //Set Column Address
        com[1] = x0; com[2] = x0;
      com[3] = 0x75; //Set Row Address
        com[4] = y0; com[5] = y1;

      if((*scroll_count) < 8){
        bbb = 0b00000001 << (*scroll_count);
      }else if((*scroll_count) >= 8){
        bbb = 0b00000001 << ((*scroll_count) - 8);
      }

      if(full_or_half == 2){
        if((*scroll_count) < 8){
          k = 1;
        }else{
          k = 0;
        }
      }else if(full_or_half ==1){
        k = 0;
      }

      break;
  }

  writeSpiCommandBytes(com, 6);  

  uint8_t color_2bytes[16];

  for(i=0; i<16; i++){
    if((buf[k][i] & bbb) > 0){
      color_2bytes[i] = Dot;
    }else{
      color_2bytes[i] = 0;
    }
  }

  writeSpiDataBytes(color_2bytes, 16);
  (*scroll_count)++;
}
//************ 256色カラー 1ピクセル 描画 *****************
void Esp32Ssd1331Bv2::drawPixel256color(uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue){
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  uint8_t com[6];
  //red (0-7), green (0-7), blue (0-3)
  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0;

  writeSpiCommandBytes(com, 6);

  uint8_t Dot = (red << 5) | (green << 2) | blue;

  writeSpiData(Dot);
}
//************ 65000色カラー 1ピクセル 描画 *****************
void Esp32Ssd1331Bv2::drawPixel65kColor(uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue){
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  uint8_t com[6];
  uint8_t color_2bytes[2];

  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0;

