mgo-tec/esp32_ssd1331_bv2/src/esp32_ssd1331_bv2.cpp
  writeSpiCommandBytes(com, 6);

  color_2bytes[0] = (red << 3) | (green >> 3);
  color_2bytes[1] = (green << 5) | blue;

  writeSpiDataBytes(color_2bytes, 2);
}
//************ 65000色カラー 1ピクセル 描画 *****************
void Esp32Ssd1331Bv2::drawPixel65kColor2(uint8_t x0, uint8_t y0, uint8_t color_2bytes[2]){
  Esp32Ssd1331Bv2::drawPixel65kColorBytes(x0, y0, color_2bytes, 2);
}
//************ 65000色カラー 1ピクセル 描画 *****************
void Esp32Ssd1331Bv2::drawPixel65kColorBytes(uint8_t x0, uint8_t y0, uint8_t *color_2bytes, uint8_t size){
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  uint8_t com[6];

  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0 + size / 2;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0;

  writeSpiCommandBytes(com, 6);

  writeSpiDataBytes(color_2bytes, size);
}
//************ 65000色　線　描画******************************
void Esp32Ssd1331Bv2::drawLine(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t line_red, uint8_t line_green, uint8_t line_blue){
  uint8_t com[8];
  //line_red (0-31), line_green (0-63), line_blue (0-31)
  uint8_t R, B;
  R = line_red <<1;
  B = line_blue <<1;

  com[0] = 0x21;
    com[1] = x0;
    com[2] = y0;
    com[3] = x1;
    com[4] = y1;
    com[5] = R;
    com[6] = line_green;
    com[7] = B;

  writeSpiCommandBytes(com, 8);
}
//************ 65000色　四角　線描画***************************
void Esp32Ssd1331Bv2::drawRectangleLine(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t line_red, uint8_t line_green, uint8_t line_blue){
  uint8_t com[13];
  //line_red (0-31), line_green (0-63), line_blue (0-31)
  uint8_t R, B;
  R = line_red <<1;
  B = line_blue <<1;

  com[0] = 0x26; //Fill Enable or Disable
    com[1] = 0b00000000; //A0=1 Fill Disable

  com[2] = 0x22; //Drawing Rectangle
    com[3] = x0; //Column Address of Start
    com[4] = y0; //Row Address of Start
    com[5] = x1; //Column Address of End
    com[6] = y1; //Row Address of End
    com[7] = R;
    com[8] = line_green;
    com[9] = B;
    com[10] = 0;
    com[11] = 0;
    com[12] = 0;

  writeSpiCommandBytes(com, 13);
}
//************ 65000色　四角　塗りつぶし描画***************************
void Esp32Ssd1331Bv2::drawRectangleFill(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t line_red, uint8_t line_green, uint8_t line_blue, uint8_t fill_red, uint8_t fill_green, uint8_t fill_blue){
  uint8_t com[13];
  //line_red (0-31), line_green (0-63), line_blue (0-31)
  //fill_red (0-31), fill_green (0-63), fill_blue (0-31)
  uint8_t lineR, lineB, fillR, fillB;
  lineR = line_red <<1;
  lineB = line_blue <<1;
  fillR = fill_red <<1;
  fillB = fill_blue <<1;

  com[0] = 0x26; //Fill Enable or Disable
    com[1] = 0b00000001; //A0=0 Fill Enable

  com[2] = 0x22; //Drawing Rectangle
    com[3] = x0; //Column Address of Start
    com[4] = y0; //Row Address of Start
    com[5] = x1; //Column Address of End
    com[6] = y1; //Row Address of End
    com[7] = lineR;
    com[8] = line_green;
    com[9] = lineB;
    com[10] = fillR;
    com[11] = fill_green;
    com[12] = fillB;

  writeSpiCommandBytes(com, 13);
}
//************* 256色カラー　円 線描画***********************
void Esp32Ssd1331Bv2::drawCircleLine256Color(uint8_t x0, uint8_t y0, uint16_t r, uint8_t line_red, uint8_t line_green, uint8_t line_blue){
  uint8_t com[6];
  //line_red (0-7), line_green (0-7), line_blue (0-3)
  uint8_t x1, y1;

  for(int i=0; i<360; i++){
    x1 = round((float)(x0 + (r * cos(radians(i)))));
    y1 = round((float)(y0 + (r * sin(radians(i)))));
    drawPixel256color(x1, y1, line_red, line_green, line_blue);
  }
  delay(1);
  //描画範囲を元に戻して置く
  com[0] = 0x15; //Set Column Address
    com[1] = 0;
    com[2] = 95;
  com[3] = 0x75; //Set Row Address
    com[4] = 0;
    com[5] = 63;

  writeSpiCommandBytes(com, 6);
}
//************* 65000色カラー　円 線描画***********************
void Esp32Ssd1331Bv2::drawCircleLine65kColor(uint8_t x0, uint8_t y0, uint16_t r, uint8_t line_red, uint8_t line_green, uint8_t line_blue){
  uint8_t com[8];
  uint8_t x1, y1;

  writeSpiCommand(0xA0); //Remap & Color Depth setting　
    writeSpiCommand(0b01110010); //A[7:6] = 00; 256 color. A[7:6] = 01; 65k color format

  for(int i=0; i<360; i++){
    x1 = round((float)(x0 + (r * cos(radians(i)))));
    y1 = round((float)(y0 + (r * sin(radians(i)))));
    drawPixel65kColor(x1, y1, line_red, line_green, line_blue);
  }
  delay(1);
  //描画範囲を元に戻して置く
  com[0] = 0xA0; //Remap & Color Depth setting　
    com[1] = 0b00110010; //A[7:6] = 00; 256 color. A[7:6] = 01; 65k color format

  com[2] = 0x15; //Set Column Address
    com[3] = 0;
    com[4] = 95;
  com[5] = 0x75; //Set Row Address
    com[6] = 0;
    com[7] = 63;

  writeSpiCommandBytes(com, 8);
}
//************* 65000色カラー　円塗りつぶし描画*****************
void Esp32Ssd1331Bv2::drawCircleFill(uint8_t x0, uint8_t y0, uint16_t r, uint8_t line_red, uint8_t line_green, uint8_t line_blue){
  //line_red (0-31), line_green (0-63), line_blue (0-31)
  uint8_t R, B;
  R = line_red <<1;
  B = line_blue <<1;

  uint8_t x1, y1;

  for(int i=0; i<360; i++){
    x1 = round((float)(x0 + (r * cos(radians(i)))));
    y1 = round((float)(y0 + (r * sin(radians(i)))));
    drawLine(x0, y1, x1, y1, R, line_green, B);
  }
}
//*********電光掲示板風スクロール 8x16ドット********************
bool Esp32Ssd1331Bv2::scrollFont8x16RtoL(uint8_t y0, uint8_t full_or_half, uint8_t font_buf[16], uint8_t* scroll_count, uint8_t *full_or_half_count, uint8_t red, uint8_t green, uint8_t blue){

  copyScroll(y0, font_buf, *scroll_count, red, green, blue);

  (*scroll_count)++;

  if(*scroll_count == 8){
    *scroll_count = 0;
    if(full_or_half == 2){
      if(*full_or_half_count == 0){
        *full_or_half_count = 1;
        return false;
      }else{
        *full_or_half_count = 0;
        return true;
      }
    }else{
      *full_or_half_count = 0;
      return true;
    }
  }

  return false;
}
//********************************************************
bool Esp32Ssd1331Bv2::scrollFont8x16RtoL4Line(uint8_t cs_pin, uint8_t y0, uint8_t num, uint8_t full_or_half, uint8_t *scroll_count, uint8_t *full_or_half_count, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  MySPI.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  MySPI.setDataMode(SPI_MODE3);
  //MySPI.setHwCs(bl);
  
