mgo-tec/esp32_ssd1331_bv2/src/esp32_ssd1331_bv2.cpp
  bool ret;

  digitalWrite(cs_pin, LOW);
  ret = Esp32Ssd1331Bv2::scrollFont8x16RtoL4Line(y0, num, full_or_half, scroll_count, full_or_half_count, font_buf, red, green, blue);
  digitalWrite(cs_pin, HIGH);

  return ret;
}

//********************************************************
bool Esp32Ssd1331Bv2::scrollFont8x16RtoL4Line(uint8_t y0, uint8_t num, uint8_t full_or_half, uint8_t *scroll_count, uint8_t *full_or_half_count, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  copyScroll(y0, font_buf[*full_or_half_count], *scroll_count, red, green, blue);

  *scroll_count = *scroll_count + 1;

  if(*scroll_count == 8){
    *scroll_count = 0;
    if(full_or_half == 2){
      if(*full_or_half_count == 0){
        *full_or_half_count = 1;
        return false;
      }else{
        *full_or_half_count = 0;
        return true;
      }
    }else{
      *full_or_half_count = 0;
      return true;
    }
  }

  return false;
}
//*********電光掲示板風スクロール 8x16ドット********************
bool Esp32Ssd1331Bv2::scrollFont8x16RtoL4Line(uint8_t y0, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  return Esp32Ssd1331Bv2::scrollHVSizeUpFont8x16RtoL(false, 1, 1, 0, 95, y0, num, full_or_half, font_buf, red, green, blue);
}
//*********電光掲示板風スクロール 8x16ドット サイズアップ********************
bool Esp32Ssd1331Bv2::scrollSizeUpFont8x16RtoL(uint8_t size, uint8_t y0, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  return Esp32Ssd1331Bv2::scrollHVSizeUpFont8x16RtoL(false, size, size, 0, 95, y0, num, full_or_half, font_buf, red, green, blue);
}
//*********電光掲示板風スクロール 8x16ドット 全角サイズアップ********************
bool Esp32Ssd1331Bv2::scrollSizeUpFont8x16RtoL(uint8_t size, uint8_t x0, uint8_t x1, uint8_t y0, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  return Esp32Ssd1331Bv2::scrollHVSizeUpFont8x16RtoL(false, size, size, x0, x1, y0, num, full_or_half, font_buf, red, green, blue);
}
//*********電光掲示板風スクロール 8x16ドット 縦、横サイズアップ********************
bool Esp32Ssd1331Bv2::scrollHVSizeUpFont8x16RtoL(uint8_t h_size, uint8_t v_size, uint8_t x0, uint8_t x1, uint8_t y0, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  return Esp32Ssd1331Bv2::scrollHVSizeUpFont8x16RtoL(false, h_size, v_size, x0, x1, y0, num, full_or_half, font_buf, red, green, blue);
}
//*********電光掲示板風スクロール 8x16ドット 縦、横サイズアップ********************
bool Esp32Ssd1331Bv2::scrollHVSizeUpFont8x16RtoL(boolean *scrolle_reset, boolean reverse, uint8_t h_size, uint8_t v_size, uint8_t x0, uint8_t x1, uint8_t y0, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  if(*scrolle_reset){
    mp_scroll_count[num] = 0;
    mp_full_or_half_count[num] = 0;
    *scrolle_reset = false;
    return false;
  }
  return Esp32Ssd1331Bv2::scrollHVSizeUpFont8x16RtoL(reverse, h_size, v_size, x0, x1, y0, num, full_or_half, font_buf, red, green, blue);

}
//*********電光掲示板風スクロール 8x16ドット 縦、横サイズアップ********************
bool Esp32Ssd1331Bv2::scrollHVSizeUpFont8x16RtoL(boolean reverse, uint8_t h_size, uint8_t v_size, uint8_t x0, uint8_t x1, uint8_t y0, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  for(int i=0; i<h_size; i++){
    Esp32Ssd1331Bv2::copyScrollSizeUp(reverse, v_size, x0, x1, y0, font_buf[mp_full_or_half_count[num]], mp_scroll_count[num], red, green, blue);
  }
  mp_scroll_count[num]++;

  if(mp_scroll_count[num] == 8){
    mp_scroll_count[num] = 0;
    if(full_or_half == 2){
      if(mp_full_or_half_count[num] == 0){
        mp_full_or_half_count[num] = 1;
        return false;
      }else{
        mp_full_or_half_count[num] = 0;
        return true;
      }
    }else{
      mp_full_or_half_count[num] = 0;
      return true;
    }
  }

  return false;
}
//***************************
void Esp32Ssd1331Bv2::copyScroll(uint8_t y0, uint8_t buf[16], uint8_t scroll_count, uint8_t red, uint8_t green, uint8_t blue){
  Esp32Ssd1331Bv2::copyScrollSizeUp(false, 1, 0, 95, y0, buf, scroll_count, red, green, blue);
}
//***************************
void Esp32Ssd1331Bv2::copyScrollSizeUp(uint8_t size, uint8_t y0, uint8_t buf[16], uint8_t scroll_count, uint8_t red, uint8_t green, uint8_t blue){
  Esp32Ssd1331Bv2::copyScrollSizeUp(false, size, 0, 95, y0, buf, scroll_count, red, green, blue);
}

//***************************
void Esp32Ssd1331Bv2::copyScrollSizeUp(boolean reverse, uint8_t size, uint8_t x0, uint8_t x1, uint8_t y0, uint8_t buf[16], uint8_t scroll_count, uint8_t red, uint8_t green, uint8_t blue){
  if(size > 4) size = 4;
  uint8_t Dot = (red << 5) | (green << 2) | blue;

  uint8_t y1 = y0 + 16 * size - 1;
  copyDisplay(x0+1, y0, x1, y1, x0, y0);

  uint8_t com[6];
  com[0] = 0x15; //Set Column Address
    com[1] = x1;
    com[2] = x1;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y1;

  writeSpiCommandBytes(com, 6);

  uint8_t bbb = 0b10000000 >> scroll_count;
  
  uint8_t max_size = 16 * size;

  uint8_t color_2bytes[max_size] = {};

  uint8_t Dot_write_cnt = 0;
  uint8_t font_read_cnt = 0;
  uint8_t i;
  uint8_t f_buf = 0;
  
  for(font_read_cnt=0; font_read_cnt<16; font_read_cnt++){
    if(reverse){
      f_buf = ~buf[font_read_cnt];
    }else{
      f_buf = buf[font_read_cnt];
    }
    if( f_buf & bbb ){
      for(i=0; i<size; i++){
        color_2bytes[Dot_write_cnt++] = Dot;
      }
    }else{
      for(i=0; i<size; i++){
        color_2bytes[Dot_write_cnt++] = 0;
      }
    }
  }

  writeSpiDataBytes(color_2bytes, max_size);
}

//********* 16x16ドット スクロール（全角限定）縦、横サイズアップ********************
bool Esp32Ssd1331Bv2::VscrollHVSizeUpFont16x16(uint8_t h_size, uint8_t v_size, uint8_t direction, uint8_t x0, uint8_t y0, uint8_t y1, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  return Esp32Ssd1331Bv2::VscrollHVSizeUpFont16x16(false, h_size, v_size, direction, x0, y0, y1, num, full_or_half, font_buf, red, green, blue);
}
//********* 16x16ドット スクロール（全角限定）縦、横サイズアップ********************
bool Esp32Ssd1331Bv2::VscrollHVSizeUpFont16x16(boolean *scrolle_reset, boolean reverse, uint8_t h_size, uint8_t v_size, uint8_t direction, uint8_t x0, uint8_t y0, uint8_t y1, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  if(*scrolle_reset){
    mp_scroll_count[num] = 0;
    *scrolle_reset = false;
    return false;
  }
  return Esp32Ssd1331Bv2::VscrollHVSizeUpFont16x16(reverse, h_size, v_size, direction, x0, y0, y1, num, full_or_half, font_buf, red, green, blue);
}
//*********　16x16ドット スクロール（全角限定）縦、横サイズアップ、縦方向スクロール********************
bool Esp32Ssd1331Bv2::VscrollHVSizeUpFont16x16(boolean reverse, uint8_t h_size, uint8_t v_size, uint8_t direction, uint8_t x0, uint8_t y0, uint8_t y1, uint8_t num, uint8_t full_or_half, uint8_t font_buf[][16], uint8_t red, uint8_t green, uint8_t blue){
  for(int i=0; i<v_size; i++){
    Esp32Ssd1331Bv2::copyVscrollSizeUpFont(reverse, h_size, direction, full_or_half, font_buf, mp_scroll_count[num], x0, y0, y1, red, green, blue);
  }
  mp_scroll_count[num]++;

