mgo-tec/esp32_ssd1331_bv2/src/esp32_ssd1331_bv2.cpp
  if(mp_scroll_count[num] == 16){
    mp_scroll_count[num] = 0;
    return true;
  }

  return false;
}
//*********** 垂直スクロール ****************
void Esp32Ssd1331Bv2::copyVscrollSizeUpFont(boolean reverse, uint8_t h_size, uint8_t direction, uint8_t full_or_half, uint8_t buf[][16], uint8_t scroll_count, uint8_t x0, uint8_t y0, uint8_t y1, uint8_t red, uint8_t green, uint8_t blue){
  uint8_t Dot = (red << 5) | (green << 2) | blue;
  uint8_t i, j, k;
  uint8_t bbb = 0b10000000;
  uint8_t color_2bytes[8 * full_or_half * h_size] = {};
  uint8_t com[6];
  uint8_t x1 = x0 + 8 * full_or_half * h_size - 1;

  switch( direction ){
    case 0:
      copyDisplay(x0, y0+1, x1, y1, x0, y0);

      com[0] = 0x15; //Set Column Address
        com[1] = x0; com[2] = x1;
      com[3] = 0x75; //Set Row Address
        com[4] = y1; com[5] = y1;
      break;
    case 1:
      copyDisplay(x0, y0, x1, y1-1, x0, y0+1);

      com[0] = 0x15; //Set Column Address
        com[1] = x0; com[2] = x1;
      com[3] = 0x75; //Set Row Address
        com[4] = y0; com[5] = y0;
      break;
  }  

  writeSpiCommandBytes(com, 6);
  
  uint8_t Dot_write_cnt = 0;
  uint8_t f_buf = 0;

  switch( direction ){
    case 0:
      for(k=0; k<full_or_half; k++){
        if(reverse){
          f_buf = ~buf[k][scroll_count];
        }else{
          f_buf = buf[k][scroll_count];
        }
        for(i=0; i<8; i++){
          if( f_buf & (bbb >> i) ){
            for(j=0; j<h_size; j++){
              color_2bytes[Dot_write_cnt++] = Dot;
            }
          }else{
            for(j=0; j<h_size; j++){
              color_2bytes[Dot_write_cnt++] = 0;
            }
          }
        }
      }
      break;
    case 1:
      for(k=0; k<full_or_half; k++){
        if(reverse){
          f_buf = ~buf[k][15-scroll_count];
        }else{
          f_buf = buf[k][15-scroll_count];
        }
        for(i=0; i<8; i++){
          if( f_buf & (bbb >> i) ){
            for(j=0; j<h_size; j++){
              color_2bytes[Dot_write_cnt++] = Dot;
            }
          }else{
            for(j=0; j<h_size; j++){
              color_2bytes[Dot_write_cnt++] = 0;
            }
          }
        }
      }
      break;
  }

  writeSpiDataBytes(color_2bytes, sizeof(color_2bytes));
}